---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures
source: html/3f6bf7b8-bc87-0731-c0e8-a0ec4a310068.htm
---
# BuiltInFailures.DimensionFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.